{"class_name": "Sequential", "config": [{"class_name": "Flatten", "config": {"input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_constraint": null, "activity_regularizer": null, "input_dim": 153600, "bias": true, "b_regularizer": null, "output_dim": 128, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_2", "b_constraint": null, "activity_regularizer": null, "input_dim": 128, "bias": true, "b_regularizer": null, "output_dim": 1, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "W_regularizer": null}}], "keras_version": "1.2.1"}