{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "input_dtype": "float32", "output_shape": [20, 40, 3], "trainable": true, "function_type": "lambda", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "batch_input_shape": [null, 20, 40, 3]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "activation": "linear", "nb_col": 3, "b_regularizer": null, "input_dtype": "float32", "b_constraint": null, "nb_filter": 32, "trainable": true, "nb_row": 3, "name": "convolution2d_1", "batch_input_shape": [null, 20, 40, 3], "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "elu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "activation": "linear", "output_dim": 128, "b_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_1", "input_dim": 21888, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "elu"}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "activation": "linear", "output_dim": 1, "b_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_2", "input_dim": 128, "W_regularizer": null}}]}